OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/near/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    outlet
    {
        type            patch;
        physicalType    outlet;
        nFaces          74;
        startFace       9399;
    }
    walls
    {
        type            wall;
        physicalType    wall;
        inGroups        1(wall);
        nFaces          78;
        startFace       9473;
    }
    frontAndBack
    {
        type            empty;
        physicalType    empty;
        inGroups        1(empty);
        nFaces          9558;
        startFace       9551;
    }
    coupled
    {
        type            patch;
        nFaces          166;
        startFace       19109;
    }
)

// ************************************************************************* //
