OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/near/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (25.75 3.62 0) ;

boundaryField
{
    outlet
    {
        type            freestream;
        freestreamValue uniform (25.75 3.62 0);
        value          uniform (25.75 3.62 0); 
    }
    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    coupled
    {
        type            socketConnectionV;
        host            chandard_ws;
        port            47011;
        communicationMode master;
        connectionType  Client;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
