OpenFOAM-2.3.0/tutorials/incompressible/simpleFoam/airfoilBGInteraction/near/0.org/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
9399
(
1.87571
1.50424
-1.04819
1.41967
1.19739
-0.854143
1.16099
1.81896
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
74
(
0.22167
0.223657
0.233861
0.235958
0.246725
0.248937
0.260294
0.262627
...
)
;
    }
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
    coupled
    {
        type            calculated;
        value           nonuniform List<scalar> 
166
(
-0.682395
-0.656656
-0.605928
-0.0944429
-0.662922
-0.601586
-0.375164
0.0982428
...
)
;
    }
}


// ************************************************************************* //
